PRINT 'Insert IrregularityTypes'
GO

SET IDENTITY_INSERT [IrregularityTypes] ON

INSERT INTO [IrregularityTypes]
    ([IrregularityTypeId], [IrregularityCategoryId], [Code]   , [Name]                                                                                          )
VALUES
-- T11
    (1                   , 1                       , N'Т11/00', N'Грешно или непълно заявление за подпомагане'                                                  ),
    (2                   , 1                       , N'Т11/01', N'Фалшиво или фалшифицирано заявление за подпомагане'                                           ),
    (3                   , 1                       , N'Т11/02', N'Продукт, животински/растителен вид, проект и/или дейност недопустими за финансиране'          ),
    (4                   , 1                       , N'Т11/03', N'Недопустимо натрупване на субсидии'                                                           ),
    (5                   , 1                       , N'Т11/04', N'Няколко заявления за един и същи продукт, животински/растителен вид, проект и/или дейност'    ),
    (6                   , 1                       , N'Т11/99', N'Други нередности, отнасящи се до заявлението за подпомагане'                                  ),

-- T12
    (7                   , 2                       , N'Т12/00', N'Грешни идентификационни данни на оператора/бенефициента'                                      ),
    (8                   , 2                       , N'Т12/01', N'Несъществуващ оператор/бенефициент'                                                           ),
    (9                   , 2                       , N'Т12/02', N'Грешни данни за холдинга'                                                                     ),
    (10                  , 2                       , N'Т12/03', N'Оператор/бенефициент, неотговарящ на изискванията за качество'                                ),
    (11                  , 2                       , N'Т12/99', N'Други нередности, свързани с оператора/бенефициента'                                          ),

-- T13
    (12                  , 3                       , N'Т13/00', N'Непълно отразяване в сметките'                                                                ),
    (13                  , 3                       , N'Т13/01', N'Грешно отразяване в сметките'                                                                 ),
    (14                  , 3                       , N'Т13/02', N'Фалшифицирани сметки'                                                                         ),
    (15                  , 3                       , N'Т13/03', N'Непредставени сметки'                                                                         ),
    (16                  , 3                       , N'Т13/04', N'Липса на счетоводни сметки'                                                                   ),
    (17                  , 3                       , N'Т13/05', N'Грешки при изчисленията'                                                                      ),
    (18                  , 3                       , N'Т13/06', N'Недеклариран приход'                                                                          ),
    (19                  , 3                       , N'Т13/99', N'Други нередности, касаещи сметки и записи'                                                    ),

-- T14
    (20                  , 4                       , N'Т14/00', N'Липсващи и/или непредставени документи'                                                       ),
    (21                  , 4                       , N'Т14/01', N'Непълни документи'                                                                            ),
    (22                  , 4                       , N'Т14/02', N'Грешни документи'                                                                             ),
    (23                  , 4                       , N'Т14/03', N'Документи, непредставени в срок'                                                              ),
    (24                  , 4                       , N'Т14/04', N'Фалшиви и/или фалшифицирани документи'                                                        ),
    (25                  , 4                       , N'Т14/99', N'Други нередности, касаещи документални доказателства'                                         ),

-- T15
    (26                  , 5                       , N'Т15/00', N'Под или над обема продукция'                                                                  ),
    (27                  , 5                       , N'Т15/01', N'Неточно състояние'                                                                            ),
    (28                  , 5                       , N'Т15/02', N'Неточен произход'                                                                             ),
    (29                  , 5                       , N'Т15/03', N'Неточна стойност'                                                                             ),
    (30                  , 5                       , N'Т15/04', N'Неточно количество'                                                                           ),
    (31                  , 5                       , N'Т15/05', N'Вариации в качеството или съдържанието'                                                       ),
    (32                  , 5                       , N'Т15/06', N'Количества извън допустимите лимити, квоти, прагове'                                          ),
    (33                  , 5                       , N'Т15/07', N'Неразрешена замяна или смяна'                                                                 ),
    (34                  , 5                       , N'Т15/08', N'Неразрешено допълване или смесване'                                                           ),
    (35                  , 5                       , N'Т15/09', N'Неоторизирано ползване'                                                                       ),
    (36                  , 5                       , N'Т15/10', N'Фалшифициране на продукт'                                                                     ),
    (37                  , 5                       , N'Т15/11', N'Неправилно съхранение или третиране'                                                          ),
    (38                  , 5                       , N'Т15/12', N'Фиктивно ползване или обработка'                                                              ),
    (39                  , 5                       , N'Т15/13', N'Неправилно класифициране (вкл. неправилен тарифен код)'                                       ),
    (40                  , 5                       , N'Т15/14', N'Наддеклариране и/или деклариране на фиктивен продукт, вид и/или земя'                         ),
    (41                  , 5                       , N'Т15/99', N'Други случаи на нередности, касаещи продукти, видове и/или земя'                              ),

-- T16
    (42                  , 6                       , N'Т16/00', N'Неизпълнено действие'                                                                         ),
    (43                  , 6                       , N'Т16/01', N'Незавършено действие'                                                                         ),
    (44                  , 6                       , N'Т16/02', N'Забранена операция в мярката'                                                                 ),
    (45                  , 6                       , N'Т16/03', N'Неспазване в крайните срокове'                                                                ),
    (46                  , 6                       , N'Т16/04', N'Неправилно прекратяване, продажба или намаляване'                                             ),
    (47                  , 6                       , N'Т16/05', N'Липса на идентификация, маркировка, други'                                                    ),
    (48                  , 6                       , N'Т16/06', N'Отказ за извършване на контрол, одит, проверка, други'                                        ),
    (49                  , 6                       , N'Т16/07', N'Контрол, одит, проверка, други, неизвършени в съответствие с регламенти, правила, план, други'),
    (50                  , 6                       , N'Т16/08', N'Нарушения при обществени поръчки'                                                             ),
    (51                  , 6                       , N'Т16/09', N'Нарушения, свързани със системата на съфинансиране'                                           ),
    (52                  , 6                       , N'Т16/10', N'Отказ за възстановяване на неизползвана или неправилно получена сума'                         ),
    (53                  , 6                       , N'Т16/99', N'Други действия, неизпълнени в съответствие с регламенти, правила, договорни условия, други'   ),

-- T17
    (54                  , 7                       , N'Т17/00', N'Нередности, свързани с крайната дестинация (промяна, непристигане, други)'                    ),
    (55                  , 7                       , N'Т17/01', N'Фиктивно транспортиране'                                                                      ),
    (56                  , 7                       , N'Т17/99', N'Други нередности, свързани с транспортирането'                                                ),

-- T18
    (57                  , 8                       , N'Т18/00', N'Ликвидация на ЮЛ'                                                                             ),
    (58                  , 8                       , N'Т18/01', N'Реорганизиране в структуриран дълг на ЮЛ'                                                     ),
    (59                  , 8                       , N'Т18/02', N'Погасителен план за ФЛ'                                                                       ),
    (60                  , 8                       , N'Т18/03', N'Невъзможност за погасителен план за ФЛ'                                                       ),
    (61                  , 8                       , N'Т18/99', N'Други'                                                                                        ),

-- T19
    (62                  , 9                       , N'Т19/00', N'Конфликт на интереси'                                                                         ),
    (63                  , 9                       , N'Т19/01', N'Подкуп – пасивен'                                                                             ),
    (64                  , 9                       , N'Т19/02', N'Подкуп – активен'                                                                             ),
    (65                  , 9                       , N'Т19/03', N'Корупция'                                                                                     ),
    (66                  , 9                       , N'Т19/99', N'Други'                                                                                        ),

-- T40
    (67                  , 10                      , N'Т40/01', N'Непубликувано обявление'                                                                                ),
    (68                  , 10                      , N'Т40/02', N'Изкуствено разделяне на договор за работа, услуги и доставки'                                           ),
    (69                  , 10                      , N'Т40/03', N'Неспазване на сроковете за приемане на оферти и заявката за участие'                                    ),
    (70                  , 10                      , N'Т40/04', N'Недостатъчно време за потенциалните участници-кандидати за набавяне на тръжна документация'             ),
    (71                  , 10                      , N'Т40/05', N'Непубликуване на удължени срокове за получаване на оферти или заявка за участие'                        ),
    (72                  , 10                      , N'Т40/06', N'Случаи, които не подлежат на процедура за пряко договаряне с предварително обявление'                   ),
    (73                  , 10                      , N'Т40/07', N'Номиниране на договори в областта на отбраната и сигурността, попадащи под директива 2009/81/ЕС'        ),
    (74                  , 10                      , N'Т40/08', N'Невъзможност да се посочи критерия за подбор или печелившия критерий'                                   ),
    (75                  , 10                      , N'Т40/09', N'Незаконен, дискриминиращ критерий за подбор, записан в обявлението или тръжната документация'           ),
    (76                  , 10                      , N'Т40/10', N'Критерии за подбор, който не е свързан и не е в съответствие с обекта на договора'                      ),
    (77                  , 10                      , N'Т40/11', N'Дискриминиращи технически изисквания'                                                                   ),
    (78                  , 10                      , N'Т40/12', N'Непълно описание на обекта на договора'                                                                 ),
    (79                  , 10                      , N'Т40/13', N'Изменение на критерия за подбор след отваряне на офертите, водещо до неправилно допускане на участници' ),
    (80                  , 10                      , N'Т40/14', N'Изменение на критерия за подбор след отваряне на офертите, водещо до неправилно отхвърляне на участници'),
    (81                  , 10                      , N'Т40/15', N'Оценка на офертите/кандидатите, ползваща незаконен критерий за подбор '                                 ),
    (82                  , 10                      , N'Т40/16', N'Липса на прозрачност и/или еднакво третиране по време на оценката'                                      ),
    (83                  , 10                      , N'Т40/17', N'Промяна на тръжната документация по време на оценката'                                                  ),
    (84                  , 10                      , N'Т40/18', N'Договаряне по време на процедурата за избор на изпълнител'                                              ),
    (85                  , 10                      , N'Т40/19', N'Процедура по договаряне с предварително публикувано обявление със съществено изменение в условията'     ),
    (86                  , 10                      , N'Т40/20', N'Отхвърляне на необичайно ниски оферти'                                                                  ),
    (87                  , 10                      , N'Т40/21', N'Конфликт на интереси'                                                                                   ),
    (88                  , 10                      , N'Т40/22', N'Съществено изменение на клаузи от договора, записани в обявлението или спецификациите на офертите'      ),
    (89                  , 10                      , N'Т40/23', N'Намаляване обхвата на договора'                                                                         ),
    (90                  , 10                      , N'Т40/24', N'Номиниране на допълнителни договори за работа/услуги/снабдявания без състезателна процедура'            ),
    (91                  , 10                      , N'Т40/25', N'Допълнителни работи/услуги, превишаващи ограничения, записани в съответните разпоредби'                 ),
    (92                  , 10                      , N'Т40/99', N'Други'                                                                                                  ),

-- T90
    (93                  , 11                      , N'Т90/99', N'Други нередности'                                                                             );
GO

SET IDENTITY_INSERT [IrregularityTypes] OFF
GO