GO

SET IDENTITY_INSERT [ErrandTypes] ON

INSERT INTO [ErrandTypes]
    ([ErrandTypeId], [ErrandLegalActId], [Code], [Name])
VALUES
    -- ЗОП - допълнение
    (10             , 1                 , N'20' , N'Състезателна процедура с договаряне'),
    (11             , 1                 , N'21' , N'Договаряне с предварителна покана за участие'),
    (12             , 1                 , N'22' , N'Партньорство за иновации'),
    (13             , 1                 , N'23' , N'Договаряне без предварителна покана за участие'),
    (14             , 1                 , N'24' , N'Договаряне без публикуване на обявление за поръчка'),
    (15             , 1                 , N'25' , N'Публично състезание'),
    (16             , 1                 , N'26' , N'Пряко договаряне')

SET IDENTITY_INSERT [ErrandTypes] OFF
GO

