PRINT 'EvalSessionProjectStandingRejectionReasons'
GO

CREATE TABLE [dbo].[EvalSessionProjectStandingRejectionReasons] (
    [EvalSessionProjectStandingRejectionReasonId]     INT             NOT NULL IDENTITY,
    [Name]                                            NVARCHAR(MAX)   NOT NULL,

    CONSTRAINT [PK_EvalSessionProjectStandingRejectionReasons] PRIMARY KEY ([EvalSessionProjectStandingRejectionReasonId])
);
GO

exec spDescTable  N'EvalSessionProjectStandingRejectionReasons', N'Основни причини за отхвърляне/отпадане/ниска оценка на проекти.'
exec spDescColumn N'EvalSessionProjectStandingRejectionReasons', N'EvalSessionProjectStandingRejectionReasonId'     , N'Уникален системно генериран идентификатор.'
exec spDescColumn N'EvalSessionProjectStandingRejectionReasons', N'Name'                                            , N'Наименование.'
/* Name exams
1. Липса на  административно съответствие (не е валидно за финансови инструменти). (Идентифицирано в резултат на извършена оценка на административното съответствие и допустимост (ОАСД))
1.1 Документацията по проектното предложение не е получена в рамките на дефинирания в Насоки за кандидатстване срок 
1.2 Информацията не е предоставена според определените в Насоки за кандидатстване  шаблони или канали за комуникация  
1.3 Некоректно изготвена документация (лисващи или грешни справки, документи, атрибути)
1.4 Липса на получен от бенефициента/получателя в срок отговор на поставени от комисията по оценка въпроси или допълнително изискани документи/разяснения.

2. Недопустимост на проекта/кандидата (идентифицирано в резултат на извършена оценка на административното съответствие и допустимост (ОАСД))
2.1 Правната форма или предметът на дейност/сектор на кандидата не отговарят на изискванията за допустимост или собствеността на дружеството не е ясна.
2.2 Партньорите по проекта  не отговарят на изискванията за допустимост.
2.3 Проектът не в съответствие с или не отговаря на приоритетите на съответната оперативна програма/приоритетна ос/инвестиционен приоритет
2.4 Проектът е стартирал (или приключил) преди даването на одобрение (само когато това е в  противоречие със съответните зададени критерии).
2.5 Установено е наличие на недопустимо дублиране с други проекти, финансирани по фондове от ЕС или с национални средства.

3. Несъответствие на технически изисквания (идентифицирано в резултат на извършена Техническа и финансова оценка (ТФО);
3.1 Проектът не доказва стратегическа необходимост и значителен ефект/ползи  - за самия кандидат, сектора или географския регион, в който ще се приложи проектът;
3.2 Не са формулирани ясни и постижими цели, съответстващи на изискванията на процедурата, заложени в поканата за изпращане на предложения
3.3 Не са налице измерими и ясно формулирани крайни резултати от проекта

*/
GO
