using System.Collections.Generic;
using System.Linq;

namespace Eumis.Database.Configurator
{
    internal class Nomenclatures
    {
        public static readonly Dictionary<int, string> MeasuresDictionary = new Dictionary<int, string>
        {
            { 1, "%" },
            { 2, "% от оборота" },
            { 3, "% от общия брой предприятия" },
            { 4, "% от подкрепените проекти по ИП 3.2" },
            { 5, "EUR" },
            { 6, "ITU/год." },
            { 7, "km" },
            { 8, "MWh/y" },
            { 9, "базова стойност-над % / целева стойност-до %" },
            { 10, "Брой" },
            { 11, "брой на година" },
            { 12, "Да/Не" },
            { 13, "дни" },
            { 14, "добавена стойност по факторни разходи (хил. лв.)/заето лице" },
            { 15, "Дял на годишния брой дни с минимална дълбочина по протежение" },
            { 16, "евро" },
            { 17, "евро /ЕС принос/" },
            { 18, "Еквивалент на пълно работно време" },
            { 19, "километри" },
            { 20, "км" },
            { 21, "км/ч" },
            { 22, "м3/год." },
            { 23, "млн. евро" },
            { 24, "млн. пътнико-километра" },
            { 25, "млн. ткм" },
            { 26, "млрд. евро" },
            { 27, "предприятия" },
            { 28, "самолетни движения" },
            { 29, "Съотношение" },
            { 30, "Съотношение (%)" },
            { 31, "т.н.е. на 1000 евро БВП" },
            { 32, "тонове CO2 екв." },
            { 33, "т./год." },
            { 34, "mg/m3" },
            { 35, "лица" },
            { 36, "хиляди души" },
            { 37, "хиляди тона" },
            { 38, "Хиляди тона нефтен еквивалент" },
            { 39, "Екв. ж." },
            { 40, "т/год." },
            { 41, "тонове" },
            { 42, "kWh/година" },
            { 43, "брой дни" },
            { 44, "домакинства" },
            { 45, "еквивалент жители" },
            { 46, "жилища" },
            { 47, "квадратни метри" },
            { 48, "Модернизирани обекти на спешна медицинска помощ" },
            { 49, "обекти" },
            { 50, "посещения/година" },
            { 51, "хектари" },
        };

        public static readonly Dictionary<int, string> FinanceSourcesDictionary = new Dictionary<int, string>
        {
            { 1, "Европейски социален фонд (ЕСФ)" },
            { 2, "Европейски фонд за регионално развитие (ЕФРР)" },
            { 3, "Кохезионен фонд (КФ)" },
            { 4, "Инициатива за младежка заетост (ИМЗ)" },
            { 5, "Фонд за европейско подпомагане на най-нуждаещите се лица (ФЕПНЛ)" },
        };

        public static readonly Dictionary<int, string> InstitutionsDictionary = new Dictionary<int, string>
        {
            { 1, "Управляващ орган" },
            { 2, "Одитен орган" },
            { 3, "Сертифициращ орган" },
            { 4, "Централно координационно звено" },
            { 5, "Контрол" },
            { 6, "Външен оценител" },
        };

        public static readonly Dictionary<int, string> ReportingTypesDictionary = new Dictionary<int, string>
        {
            { 1, "Ръчно" },
            { 2, "Автоматично" },
        };

        public static readonly Dictionary<int, string> BudgetPeriodsDictionary = new Dictionary<int, string>
        {
            { 1, "2014" },
            { 2, "2015" },
            { 3, "2016" },
            { 4, "2017" },
            { 5, "2018" },
            { 6, "2019" },
            { 7, "2020" },
        };
    }
}
