PRINT 'ProcedureTypes'
GO

CREATE TABLE [dbo].[ProcedureTypes] (
    [ProcedureTypeId]   INT             NOT NULL IDENTITY,
    [Name]              NVARCHAR(MAX)   NOT NULL,
    [Alias]             NVARCHAR(50)    NULL

    CONSTRAINT [PK_ProcedureTypes] PRIMARY KEY ([ProcedureTypeId])
);
GO

exec spDescTable  N'ProcedureTypes', N'Типове процедура.'
exec spDescColumn N'ProcedureTypes', N'ProcedureTypeId'     , N'Уникален системно генериран идентификатор.'
exec spDescColumn N'ProcedureTypes', N'Name'                , N'Наименование.'
exec spDescColumn N'ProcedureTypes', N'Alias'               , N'Псевдоним.'
/* Name exams
Директно предоставяне
Открита проц. конкур. подбор с опред. срок на кандид.
Открита проц. конкур. подбор без опред. срок на кандид.
Открита проц. на подбор на проекти, покриващи опред.изискв-я за кач-во с опред.срок на канд-не
Открита проц. на подбор на проекти, покриващи опред.изискв-я за кач-во без опред.срок на канд-не
С предвар. конкур. подбор с опред.срок на канд-не
С предвар. конкур. подбор без опред.срок на канд-не
С предвар. подбор на проекти, покриващи опред. изискв-я за кач-во с опред. срок на канд-не
С предвар. подбор на проекти, покриващи опред. изискв-я за кач-во без опред. срок на канд-не
Директно предоставяне със СРИП

От бизнес анализа :
•	на подбор на проекти 
    •	стандартна процедура за подбор на проекти с един или няколко крайни срока;
    •	процедура с предварителен подбор, която включва два етапа;
    •	стандартна процедура за подбор на интегрирани проекти.
•	чрез директно предоставяне.
    •	процедура за директно предоставяне;
    •	процедура за директно предоставяне на интегрирано проектно предложение;
    •	бюджетна линия.

*/
GO
