PRINT 'Insert ExpenseSubTypes'
GO

SET IDENTITY_INSERT [ExpenseSubTypes] ON

INSERT INTO [ExpenseSubTypes]
    ([ExpenseSubTypeId], [ExpenseTypeId], [Name])
VALUES
--І. РАЗХОДИ ЗА ОРГАНИЗАЦИЯ И УПРАВЛЕНИЕ
    (1          , 1, N'Възнаграждения (брутни суми, вкл.и дължимите от работодателя осигурителни вноски)'),
    (2          , 1, N'Разходи за командировки'),
    
--II. РАЗХОДИ ЗА ВЪЗНАГРАЖДЕНИЯ
    (3          , 2, N'Възнаграждения (брутни суми, вкл.и дължимите от работодателя осигурителни вноски)'),
    (4          , 2, N'Разходи за командировки'),

--III. РАЗХОДИ ЗА ДМА
    (5          , 3, N'Закупуване на оборудване, съоръжения и обзавеждане'),
    (8          , 3, N'Закупуване на машини'),
    (9          , 3, N'Закупуване на земя'),
    (10         , 3, N'Други (моля уточнете)'),

--IV РАЗХОДИ ЗА ДНА
    (11         , 4, N'Закупуване на патенти, лицензи, права'),
    (12         , 4, N'Закупуване на софтуер'),
    (13         , 4, N'Други (моля уточнете)'),

--V РАЗХОДИ ЗА СМР
    (14         , 5, N'Разходи за СМР сгради'),
    (15         , 5, N'СМР инфраструктура'),
    (16         , 5, N'Други (моля уточнете)'),

--VI РАЗХОДИ ЗА УСЛУГИ
    (17         , 6, N'Разходи за проектиране, проучвания, анализи, стратегии, програми и т.н.'),
    (18         , 6, N'Разходи за организиране на и/или участие в събития (международни изложения, панаири и т.н.)'),
    (19         , 6, N'Разходи за обучения'),
    (20         , 6, N'Разходи за маркетинг и реклама'),
    (21         , 6, N'Разходи за одит на проекта'),
    (22         , 6, N'Други услуги - моля опишете'),

--VII РАЗХОДИ ЗА ПУБЛИЧНОСТ И ВИЗУАЛИЗАЦИЯ
    (23         , 7, N'Разходи за материали за публичност и визуализация'),
    (24         , 7, N'Разходи за дейности по информиране и публичност за проекта, съфинансиран по Оперативната програма'),

--VIII  РАЗХОДИ ЗА МАТЕРИАЛИ
    (25         , 8, N'Разходи за закупуване на материали'),
    (26         , 8, N'Разходи за закупуване на консумативи'),

--IX ОПРОСТЕНИ РАЗХОДИ
    (27         , 9, N'25. Разходи по стандартна таблица на разходите за единица продукт'),
    (28         , 9, N'26. Еднократни суми, които не надхвърлят левовата равностойност на 100 000 евро публичен принос'),
    (29         , 9, N'27. Финансиране с единна ставка'),
    (30         , 9, N'28. Разходи за амортизация'),
    (31         , 9, N'29. Разходи за закупуване на втора употреба оборудване'),

--X. Невъзстановим ДДС (ако е приложимо)
    (32         , 9, N'X. Невъзстановим ДДС (ако е приложимо)')
    
SET IDENTITY_INSERT [ExpenseSubTypes] OFF
GO
