PRINT 'Insert ProcedureTypes'
GO

SET IDENTITY_INSERT [ProcedureTypes] ON

INSERT INTO [ProcedureTypes]
    ([ProcedureTypeId], [Name], [Alias])
VALUES
    (1          , N'Процедура на директно предоставяне'                                   , NULL),
    (2          , N'Процедура на подбор на проекти с един срок за кандидатстване'         , NULL),
    (3          , N'Процедура на подбор на проекти с няколко срока на кандидатстване'     , NULL),
    (4          , N'Предварителен подбор на концепции за проектни предложения'            , NULL),
    (5          , N'Процедура на директно предоставяне без краен срок за кандидатстване'  , NULL),
    (6          , N'Процедура на директно предоставяне чрез бюджетна линия'               , NULL),
    (7          , N'Съвместен план'                                                       , NULL),
    (8          , N'Голям проект'                                                         , NULL),
    (9          , N'Процедура за фонд на фондовете и ЕИФ'                                 , N'fof'),
    (10         , N'Процедура за финансови посредници'                                    , N'agents'),
    (11         , N'Процедура за крайни получатели'                                       , N'endusers')

SET IDENTITY_INSERT [ProcedureTypes] OFF
GO
