[
  { "Dimension": "Област на интервенция", "InterventionCategory": "002 Научноизследователски и иновационни процеси в големи предприятия", "Amount": 100.00 },
  { "Dimension": "Форма на финансиране", "InterventionCategory": "02 Средства, подлежащи на възстановяване", "Amount": 100.00 },
  { "Dimension": "Тип на територията", "InterventionCategory": "02 Малки градски райони (среднонаселени, с население >5 000 души)", "Amount": 100.00 },

  { "Dimension": "Механизми за териториално изпълнени", "InterventionCategory": "ЕФРР", "Amount": 100.00 },
  { "Dimension": "Тематична цел (ЕФРР и Кохезионен фонд)", "InterventionCategory": "06 Съхраняване и опазване на околната среда и насърчаване на ресурсната ефективност", "Amount": 100.00 },
  { "Dimension": "Вторична тема на ЕСФ", "InterventionCategory": "02 Социални иновации", "Amount": 100.00 },
  { "Dimension": "Стопанска дейност", "InterventionCategory": "01 Селско и горско стопанство", "Amount": 100.00 }
 

]
